In [1]:
import numpy as np
import pandas as pd

### Load Data

In [2]:
df = pd.read_csv('CarsData.csv')

### Data Exploration

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 97712 entries, 0 to 97711
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   model         97712 non-null  object
 1   year          97712 non-null  int64
 2   price         97712 non-null  int64
 3   transmission  97712 non-null  object
 4   mileage       97712 non-null  int64
 5   fuelType      97712 non-null  object
 6   tax           97712 non-null  int64
 7   mpg           97712 non-null  float64
 8   engineSize    97712 non-null  float64
 9   Manufacturer  97712 non-null  object
dtypes: float64(2), int64(4), object(4)
memory usage: 7.5+ MB

In [4]:
df.head()

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize,Manufacturer
0,I10,2017,7495,Manual,11630,Petrol,145,60.1,1.0,hyundi
1,Polo,2017,10989,Manual,9200,Petrol,145,58.9,1.0,volkswagen
2,2 Series,2019,27990,Semi-Auto,1614,Diesel,145,49.6,2.0,BMW
3,Yeti Outdoor,2017,12495,Manual,30960,Diesel,150,62.8,2.0,skoda
4,Fiesta,2017,7999,Manual,19353,Petrol,125,54.3,1.2,ford

In [5]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
year,97712.0,2017.066502,2.118661,1970.0,2016.0,2017.0,2019.0,2024.0
price,97712.0,16773.487555,9868.552222,450.0,9999.0,14470.0,20750.0,159999.0
mileage,97712.0,23219.475499,21060.882301,1.0,7673.0,17682.5,32500.0,323000.0
tax,97712.0,120.142408,63.357250,0.0,125.0,145.0,145.0,580.0
mpg,97712.0,55.205623,16.181659,0.3,47.1,54.3,62.8,470.8
engineSize,97712.0,1.664913,0.558574,0.0,1.2,1.6,2.0,6.6

In [8]:
df.isna().sum()

model           0
year            0
price           0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
Manufacturer    0
dtype: int64

In [10]:
df[df.duplicated()]

Empty DataFrame
Columns: [model, year, price, transmission, mileage, fuelType, tax, mpg, engineSize, Manufacturer]
Index: []

In [21]:
for c in df.columns:
    print(f"{c}: {len(df[c].unique())}")

model: 196
year: 27
price: 13236
transmission: 4
mileage: 42214
fuelType: 5
tax: 48
mpg: 208
engineSize: 40
Manufacturer: 9